{
  "base_model_name_or_path": "mistralai/Mistral-7B-v0.1",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 128,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "target_modules": [
    "q_proj",
    "v_proj",
    "k_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "fine_tune_dataset": "50000 EU and Irish legal documents from EUR-Lex and Irish Statute Book",
  "fine_tune_epochs": 3,
  "fine_tune_lr": 0.0002,
  "legal_domain_coverage": [
    "EU AI Act",
    "GDPR",
    "Irish Contract Law",
    "Irish Employment Law",
    "Irish Company Law"
  ]
}